{"path": ["**Campus Life**", "**1. Life at 1337**"], "content": "Life at 1337 is built on autonomy, collaboration, and accountability. Here, you take ownership of your learning journey, setting your own pace, managing your time, and finding your own solutions. The school provides the tools, the environment, and the community, but the drive and commitment must come from you.\n\nIndependence at 1337 is a privilege that comes with responsibility. Every student is trusted to use that freedom wisely, to learn consistently, to contribute to others' growth, and to stay engaged in the shared energy of the campus.\n\nBeing part of 1337 means more than just coding; it means belonging to a community built on respect, creativity, and integrity, where your progress and the collective success of your peers go hand in hand."}
{"path": ["**Campus Life**", "**2. Respect and Behavior**"], "content": "Respect is one of the most important values at 1337. Our community is built on collaboration and diversity, people from different backgrounds, experiences, and perspectives working together.\n\n Every student is expected to show maturity, kindness, and professionalism in all interactions.\n\n### **You are expected to:**\n\n- Treat every person with respect, regardless of status, opinion, or background.\n- Use appropriate language at all times.\n\n- Be honest and fair in all your work.\n- Resolve conflicts calmly and constructively.\n- Act in a way that contributes to a positive and safe learning environment.\n\n### **You must not:**\n\n- Harass, bully, or discriminate against anyone.\n- Engage in verbal or physical aggression.\n- Engage in behavior that harms others' work or focus.\n\nRespect is the foundation of trust, and trust is what allows 1337 to function. Violations of this policy may result in disciplinary measures, including loss of privileges, suspension, or exclusion."}
{"path": ["**Campus Life**", "**3. Hazing & Harassment**"], "content": "Hazing, bullying, or harassment of any kind is strictly forbidden at 1337. The school maintains a zerotolerance policy toward any act that humiliates, pressures, or threatens another person, whether on campus, in dorms, or online.\n\n### **Examples of prohibited behavior include:**\n\n- Forcing or pressuring someone to perform unwanted tasks.\n- Publicly humiliating or isolating a student.\n- Engaging in any behavior or activity that intimidates, pressures, or excludes others..\n- Any physical, verbal, or psychological aggression.\n- Sharing or posting content meant to harm someone's reputation.\n\n### **If you witness or experience hazing or harassment:**\n\n- Report it immediately to the BOCAL or any staff.\n- Reports are handled with full confidentiality and taken seriously.\n- If you witness such behavior, speak up, your action helps protect the community.\n\n**1337 is a space for learning, not fear. Every student has the right to feel safe, respected, and supported.**"}
{"path": ["**Campus Life**", "**4. Smoke-Free Campus**"], "content": "Smoking, vaping, and e-cigarettes are only allowed in the designated smoking area. **They are not allowed anywhere else on campus**, including dorms, clusters, meeting rooms, playgrounds, or near entrances.\n\n### **Rules:**\n\n- Smoking & vaping are only allowed in the designated smoking area.\n- Drugs & illegal substances are strictly forbidden.\n- Cigarette waste must be properly disposed of in the bins provided.\n- Breaking these rules may lead to disciplinary action."}
{"path": ["**Campus Life**", "**5. Restaurant**"], "content": "The restaurant is part of your student benefits; it's the school restaurant where meals are offered to students who are actively studying and participating on campus.\n\n**The principle is simple:** *If you are studying at school, the school provides the food, throughout your entire 1337 journey, before and after the Common Core.*\n\nTo ensure this benefit is fairly distributed, attendance and activity are tracked**.**\n\nIf you fall below the required activity level, your restaurant access may be suspended until you meet your LOGTIME requirements.\n\n**Requirements: 30 hours of LOGTIME per week,** (More details about this in the ATTENDO Section)**.**\n\n### **Behavior in the restaurant:**\n\n- Keep the space clean and organized.\n- Return trays and utensils after eating.\n- Respect the staff and other students."}
{"path": ["**Campus Life**", "**6. Housing**"], "content": "Housing is a benefit for actively engaged students and is offered only on campuses with available housing facilities, depending on capacity and compliance with housing regulations. It is monitored through internal systems that track progress, presence, and participation.\n\nThe purpose of this system is to make sure housing is used by students who are present, learning, and contributing, not by those who stay isolated in their rooms.\n\n### **Rules:**\n\n- Each student has 18 months of housing credit during the Common Core.\n- You must log at least 120 hours of activity per month to keep housing.\n- If a student does not meet this requirement, one month will be deducted from the total housing credit, unless the student has checked out of the room.\n- Extensions or exceptions must be approved by the BOCAL.\n\nHousing is a privilege that supports your learning and presence at school.\n\nMisuse of housing or failure to meet requirements may lead to loss of benefits."}
{"path": ["**Campus Life**", "**7. Campus Spaces & Facilities**"], "content": "The 1337 campus is a professional learning environment. Every student shares responsibility for maintaining it.\n\n### **You must:**\n\n- Keep all spaces clean and organized; clusters, labs, meeting rooms, and playgrounds.\n- Use each area for its intended purpose.\n- Use meeting rooms only for meetings & discussions.\n- Do not use meeting rooms for work, rest, or leisure.\n- Do not occupy meeting rooms for long periods.\n- Leave the room clean and available once your meeting ends.\n- Avoid eating or drinking in clusters.\n- Do not move or modify furniture or hardware without permission.\n- Report any technical issue or damage immediately to the Bocal.\n\n### **You must not:**\n\n- Damage school property.\n- Leave personal items or trash in shared spaces.\n- Block entrances or disrupt work areas.\n\nStudents who damage or misuse facilities may face disciplinary actions. Treat the campus as your professional workspace, because it is."}
{"path": ["**Campus Life**", "**8. Lost and Found**"], "content": "1337 is not responsible for lost or stolen belongings. Students are expected to care for their personal property at all times.\n\n### **If you lose or find something:**\n\n- Report it on the \"Lost & Found\" Discord channel or directly to the BOCAL.\n- Found items are stored for one month. After that, they are discarded.\n- Items left in shared spaces are removed.\n- If you request to check camera footage, you must specify the exact location and time window of the incident.\n- Stealing or attempting to take someone else's belongings will result in disciplinary action.\n\nKeep your valuables safe and be respectful of others' property."}
{"path": ["**Campus Life**", "**9. Storage Room**"], "content": "The storage room is provided to help students keep their personal belongings safe and the campus organized. To maintain order and hygiene, all items must follow these rules:\n\n- **Only closed bags** are allowed in the storage room.\n- Loose items, open bags, or sachets are not permitted.\n- Any item not properly stored in a closed bag will be **removed and discarded without exception**.\n- Please make sure your belongings are labeled and organized to keep the space clean and accessible for everyone."}
{"path": ["**Campus Life**", "**10. Noise & Campus Etiquette**"], "content": "1337 encourages collaboration and discussion, but not disruption. Be mindful of others who are working or studying or your neighborhood.\n\n### **Noise rules:**\n\n- Keep conversations at a moderate volume.\n- Use headphones for calls, videos, music, or games.\n- **Silent clusters are for focused work only, no conversations, calls, or discussions are allowed.**\n\n• Avoid loud discussions in all work areas like clusters, meeting rooms, coworking spaces, labs or outside the school especially by night (9pm to 8am).\n\n*Student HandBook*\n\n### **Important Note:**\n\nThe school is located near a residential & professional areas. Out of respect for our neighbors and the community, you must keep noise levels low outside the school, especially between 9:00 PM & 8:00 AM. Loud conversations, gatherings, or music during these hours are strictly prohibited."}
{"path": ["**Campus Life**", "**11. Presence & Engagement**"], "content": "Your presence is what keeps 1337 alive. This is not a remote learning environment; the school thrives on in-person collaboration and shared energy.\n\nBeing present means more than just showing up, it means participating, sharing ideas, and helping others grow."}
{"path": ["**Community Conduct**", "**12. Access & visits**"], "content": "### **a. Access to the School**\n\n- All active students have free access to the school at any time using their personal student badge.\n- Your badge is strictly personal. Sharing or using another student's badge is strictly prohibited and may lead to disciplinary action.\n- Students in the following statuses are not allowed to access the school, the campus, or any related benefits (housing, cafeteria, transportation, etc.):\n  - o Blackhole (definitively)\n  - o Freeze status (temporarily)\n  - o Suspended (temporarily)\n  - o Alumni (unless approved by the Bocal or through a special request)\n- Access is automatically restored when your status returns to \"Active\".\n\n### **b. Visits**\n\n- Students who wish to invite someone to visit the school must submit a visit request to the Bocal at least 48 hours in advance.\n- The request must clearly include the visitor's full name and the purpose of the visit.\n- Visits are only allowed on weekdays and during official office hours.\n- The student is fully responsible for their guest during the entire visit. They must accompany them at all times and ensure that the visitor respects all school rules, facilities, and community standards.\n- Unannounced or unauthorized visitors are strictly prohibited."}
{"path": ["**Community Conduct**", "**1. Being Part of the 1337 Community**"], "content": "1337 is more than a school, it's a community built on trust, respect, and collaboration. Everyone contributes to the culture here. Every action, whether in person or online, shapes the environment we share.\n\nYour freedom at 1337 is balanced by responsibility. You are trusted to act with maturity, represent the school with integrity, and protect the atmosphere that allows everyone to learn and grow.\n\n### **Being part of 1337 means:**\n\n- Respecting others' work, time, and space.\n- Helping your peers when they need support.\n- Giving feedback constructively.\n- Keeping communication respectful and professional.\n- Following the school's rules, both online and offline.\n\n**Note:** All students are expected to respect and abide by Moroccan laws at all times, both on and off campus. Any action that violates the law may result in disciplinary measures in addition to legal consequences."}
{"path": ["**Community Conduct**", "**2. Communication & Collaboration**"], "content": "Communication is a key part of life at 1337. How you express yourself, in discussions, on Discord, or during projects, affects the entire atmosphere of the school.\n\n### **Good communication means:**\n\n- Being clear, kind, and direct.\n- Using language that is appropriate for a professional environment.\n\n### **Unacceptable communication includes:**\n\n- Insults or public humiliation.\n- Offensive jokes or discriminatory comments.\n- Spamming, flooding, or hijacking communication channels.\n- Sharing misleading or false information.\n\nDiscussions and debates are part of learning, but disrespect, mockery, or personal attacks are not."}
{"path": ["**Community Conduct**", "**3. Online Conduct & Digital Responsibility**"], "content": "Much of 1337's collaboration happens online on Discord and the Intranet. Digital spaces are extensions of our physical community, and the same rules of respect apply.\n\n### **When using online platforms:**\n\n- Communicate respectfully and professionally.\n- Keep channels relevant to their purpose.\n- Protect others' privacy and data.\n- Follow moderation and community guidelines set by the BOCAL.\n\nYour online conduct reflects you and the school. Use digital spaces responsibly and professionally. Any misuse may lead to disciplinary action including access restrictions, suspension, or exclusion."}
{"path": ["**Community Conduct**", "**4. IT and System Use**"], "content": "Technology is at the center of how 1337 operates. Every student is given access to the school's digital systems and infrastructure. With that access comes trust, and responsibility.\n\nRules for using school systems:\n\n- Always use your own credentials.\n- Keep your passwords private and secure.\n- Never share your account or use someone else's.\n- Do not try to access or modify data you are not authorized to see.\n- Do not alter or damage school hardware, software, or networks.\n\n• Do not use fake profiles or conceal your identity.\n\nAny misuse of systems may result in disciplinary measures, including access restrictions, suspension, or exclusion. These systems are here to support your learning, use them responsibly."}
{"path": ["**Community Conduct**", "**5. Data Security & Privacy**"], "content": "1337 is a place of learning, but also a digital ecosystem where trust and security matter.\n\nStudents are expected to handle data, their own and others', with care and integrity, and according to the Moroccan data regulation (CNDP).\n\n### **Data protection rules:**\n\n- Do not share personal or confidential information, such as passwords, private messages, student data, internal documents, or any sensitive school-related content.\n- Do not attempt to intercept or access data that is not yours.\n- Avoid using external systems or servers in ways that violate privacy or laws.\n- Report any security incident or suspicious behavior to the BOCAL immediately.\n\nRespecting data is part of respecting the people behind it."}
{"path": ["**Community Conduct**", "**6. Personal Responsibility & Accountability**"], "content": "At 1337, your account, your work, and your actions are your responsibility. Everything you do under your credentials, whether in a project, a correction, or online, is treated as your own action.\n\n### **You are expected to:**\n\n- Protect your digital identity.\n- Take ownership of your mistakes and learn from them.\n- Act with honesty and fairness in all evaluations and collaborations.\n\nIf your account or privileges are misused, you will be held accountable, even if it was done by someone using your access."}
{"path": ["**Community Conduct**", "**7. Equipment and Campus Infrastructure**"], "content": "All 1337 equipment — computers, networks, and technical infrastructure — is shared property.\n\nUsing it correctly ensures that everyone can work and learn in the best possible conditions.\n\n### **You must:**\n\n- Handle all equipment with care.\n- Avoid unplugging or reconfiguring setups without permission.\n- Report damaged, malfunctioning equipment or any other issue in the clusters to the BOCAL.\n- Use school devices for learning purposes only. You must not:\n- Attempt to alter, hack, or bypass any system configuration.\n- Use school networks for illegal, harmful, or nonacademic activities.\n\n### **Remember:**\n\nYou are training to be a responsible developer. Respecting the systems you use is part of that training."}
{"path": ["**Community Conduct**", "**8. Integrity and Trust**"], "content": "Everything at 1337 is built on trust, the projects, the peer evaluations, the collaboration.\n\nIntegrity is not just a rule; it's the foundation of how we learn and succeed together.\n\n### **You are expected to:**\n\n- Do your own work honestly.\n- Credit others when you use or adapt their ideas.\n- Give fair and honest evaluations during peer corrections.\n- Avoid copying, falsifying, or sharing code without authorization.\n\nViolations of academic integrity, including cheating, plagiarism, or falsifying evaluations/corrections, are treated seriously and may result in sanctions, suspension, or exclusion.\n\nAt 1337, your credibility is worth more than any project score."}
{"path": ["**Community Conduct**", "**9. Professionalism in Community Life**"], "content": "Your time at 1337 is also preparation for your future career. The way you behave, communicate, and collaborate here mirrors the professional world.\n\n### **You are encouraged to:**\n\n- Take initiative and contribute to campus life.\n- Offer help to peers who are struggling.\n- Engage in community events, hackathons, or workshops.\n- Use feedback to grow and improve.\n\nThe school is your training ground, use it to build not only your technical skills, but also your professional habits and attitude."}
{"path": ["**Community Conduct**", "**10. Sanctions and Accountability**"], "content": "Every rule at 1337 is meant to protect the community. When someone violates those rules, consequences are applied to preserve fairness and respect for everyone else.\n\n### **Sanctions can include:**\n\n- Warnings or formal notices.\n- Temporary suspension of privileges (Restaurant, Scholarship, housing, etc.).\n- Restriction of access to systems or facilities.\n- Full suspension or exclusion in serious cases.\n\nAll disciplinary actions are reviewed by the BOCAL and handled with fairness, confidentiality, and documentation.\n\nThe goal of a sanction is not punishment; it's accountability and growth."}
{"path": ["**Academic Life & Pedagogy**", "**11. Remember: You Shape the Culture**"], "content": "At 1337, culture is not imposed, it's created by the people in it.\n\nYour words, actions, and choices define what kind of community this will be.\n\nEvery student has the power to make 1337 a place where people feel safe to learn, fail, and try again.\n\nBe the kind of peer others want to collaborate with, respectful, honest, curious, and driven.\n\nThe school will give you opportunities, freedom, and trust.\n\nIt's up to you to live up to them.\n*This community*  **\"** *is a mirror: the more you give to it, the stronger it becomes.*"}
{"path": ["**Academic Life & Pedagogy**", "**1. Learning at 1337**"], "content": "Learning at 1337 is unlike any other experience. There are no teachers, no lectures, and no fixed curriculum. You are the main actor in your learning journey.\n\nYou learn by doing, by failing, by trying again, and by sharing what you've discovered with others.\n\nThe school gives you the structure, the tools, and the community.\n\nYou bring the motivation, the curiosity, and the discipline.\n\nThis model works only if you stay engaged, proactive, and honest with yourself and others."}
{"path": ["**Academic Life & Pedagogy**", "**2. The Peer-to-Peer Model**"], "content": "The principles are simple:\n\n- **1. You learn by doing.** Every project challenges you to apply and explore new concepts.\n- **2. You learn by sharing.** Teaching others helps you understand more deeply.\n- **3. You learn by collaborating.** Working with others builds creativity and resilience.\n\nPeer evaluation is not just part of the system; it is the system. It trains you to give feedback, defend your choices, and communicate like a professional."}
{"path": ["**Academic Life & Pedagogy**", "**3. Projects & Evaluations**"], "content": "Projects are at the core of 1337's learning experience. Each project builds both technical and behavioral skills, helping you grow step by step.\n\n### **a. Solo Projects:**\n\nYou are fully responsible for the work. You must understand every part of your code and be able to explain it.\n\n### **b. Group Projects:**\n\nYou are responsible for your part and must understand the project's overall logic and goals. Collaboration, clear communication, and fair task distribution are key to success.\n\n### **c. Evaluation Process:**\n\n- Projects are evaluated through peer correction.\n- Each student acts as both corrector and corrected.\n- The process helps you practice critical thinking and technical analysis.\n- No third party may interfere in a correction, only the corrector and the corrected participate.\n\nIf a project doesn't pass, it's not failure, it's feedback. Every attempt is an opportunity to learn and improve.\n\n### **d. Correction Attendance and Conduct**\n\nCorrections are an essential learning and community exercise based on respect and fairness.\n\n### **Rules:**\n\n- You must attend scheduled corrections on time.\n- If you need to cancel or reschedule, notify the corrector in advance.\n- If the corrector does not respond within 30 minutes, the correction can be cancelled and rescheduled.\n- Correctors must follow the official correction sheet and stay within the project's core concepts. They may test or question any aspect related to the project, but not beyond the defined project scope. Corrections are meant for learning not for intimidation or revenge.\n\n• If a correction becomes disrespectful or unfair, report it to the BOCAL. It can be repeated in the presence of staff if needed.\n\n### **Sanctions:**\n\n- Missing or cancelling a correction without valid reason: 2-day suspension.\n- Cancelling projects more than three times: 1-week suspension and temporary loss of benefits.\n- Validating a cheated project during correction: 15-day suspension, in addition to possible further sanctions.\n\n**The correction process is strictly between the corrector and the corrected, no third party may intervene or be present during the evaluation.**"}
{"path": ["**Academic Life & Pedagogy**", "**4. Recoding**"], "content": "At 1337, the goal is not only to finish projects but to master what you build. **Every student should expect to be recoded for at least one project during the Common Core**, this is a normal part of the learning process designed to verify understanding and mastery. Recoding is not a punishment. It is a competency check used to confirm that each student can reproduce and explain their work independently.\n\n### **In addition to the systematic recoding, it may also apply in the following cases:**\n\n- Your code is identical or very similar to another student's.\n- There are irregularities, such as:\n  - o Unusual last-minute pushes.\n  - o Suspiciously fast project completion.\n  - o Repeated identical submissions.\n  - o Reports or alerts from peers.\n- A student repeatedly fails to pass a circle exam after multiple attempts (three attempts).\n\n### **What recoding involves:**\n\n- Rewriting the project, or a part of it, under observation.\n- Explaining your code and logic step-by-step to a staff member.\n- Demonstrating full understanding of the project's goals, functions, and structure.\n\nRecoding proves your work is truly yours and ensures fairness and credibility for everyone."}
{"path": ["**Academic Life & Pedagogy**", "**5. Sanctions Related to Cheating**"], "content": "1337 operates on trust, your progress, evaluations, and collaboration are all based on honesty. Any form of cheating, plagiarism, or dishonesty breaks that trust and harms the integrity of the community.\n\n### **Cheating means more than copying code. It includes:**\n\n- Pushing a project you don't fully understand or can't reproduce.\n- Sharing or duplicating code between students.\n- Submitting identical or suspiciously similar projects.\n- Manipulating or falsifying corrections.\n- Engaging in unfair behavior during peer corrections or projects.\n\nCheating can be detected through identical code submissions, unusual push activity, reports, or inability to explain one's work during recoding.\n\n### **Sanctions for cheating:**\n\n- **First Attempt:** One-month suspension and a mandatory systematic recoding immediately afterward.\n- **Second Attempt:** Permanent exclusion from the school.\n- **A second chance** after the first offense is not guaranteed and will be granted only in exceptional cases.\n- **If two students have identical solo projects:**  Both receive 15 days suspension and a mandatory systematic recoding immediately afterward.\n\n### **Important:**\n\nCheating during a correction, validating a cheated project, or ignoring correction rules can also result in sanctions.\n\n### **Remember:**\n\nThese rules exist not to punish but to protect fairness and the value of your hard work.\n\n*You are here to learn, not to fake success.*"}
{"path": ["**Academic Life & Pedagogy**", "**6. Benefits and Engagement Policy**"], "content": "1337 provides social benefits (housing, meals, insurance, and scholarship) to help every student focus fully on learning and growing. These supports exist so that you can dedicate your time and energy to developing your skills and preparing for your future, without external barriers.\n\nBut with this support comes responsibility. These benefits are meant to help you progress, not to be taken for granted or used without genuine engagement. Misusing them, staying inactive, or trying to take advantage of the system goes against the values of 1337 and the trust it places in you.\n\nAt 1337, each benefit is connected to the school's systems — the **Heart System**, the **Supervisor**, and **LOGTIME tracking**, to make sure that everyone uses these resources fairly and responsibly.\n\n### **Important Note:**\n\nStudents who are full time employees are not eligible for social benefits provided by 1337, including housing, meals, insurance, or scholarships."}
{"path": ["**Academic Life & Pedagogy**", "**7. The Heart System**"], "content": "### **(Common Core Progress Tracking)**\n\nThe **Common Core** can be completed in a **maximum of two years** (24 months). However, the **average duration** expected for progression is **18 months**, also known as **Pace 18**.\n\nDuring these **18 months**, the school provides full **student benefits** (scholarship, housing, meals, etc.) to support your learning journey.\n\nTo help you **stay on track** and **maintain your benefits**, the **Heart System** has been introduced. Each student starts the Common Core with **three hearts**, representing their capacity to progress within Pace 18.\n\n### **Rules**:\n\n- Each time you fall behind Pace 18, you lose one heart.\n- Hearts cannot be regained once lost.\n- After losing a heart, you have **up to three months** to recover your progress and return to Pace 18.\n- **You have a total credit of 18 months** to complete the Common Core; this includes any catch-up period.\n\nIf you lose all 3 hearts, **you lose all your social benefits**, **only your access to the school remains**. You can still continue your education, but without housing, meals, or other benefits. This system helps you manage your time, stay consistent, and take ownership of your learning path.\n\n**Note:** *The Heart System applies to students starting*  from the 2025 cohort."}
{"path": ["**Academic Life & Pedagogy**", "**8. The Supervisor System**"], "content": "### **(After the Common Core)**\n\nAfter completing the common core, each student enters the **Slot system**, which regulates progression and access to school benefits.\n\n- Each **Slot** has a duration of **four (4) months**.\n- During this period, the student must complete specific **pre-requisites**, which include:\n- o A defined **XP target** to achieve;\n- o A required number of **peer corrections** to perform;\n- o A minimum **logtime** per month;\n- o And overall engagement in the learning process.\n- At the end of each Slot, an **assessment meeting**  is conducted with the staff to review the student's performance and identify any difficulties or reasons for non-achievement.\n\nIf the student has not met all required objectives:\n\n- They are **granted a new Slot** (4 additional months),\n- **All benefits are maintained**,\n- But the student is required to **recover all pending credits** from the previous Slot.\n\nAfter two consecutive Slots without meeting the required achievements,\n\n- o **All school benefits are suspended**,\n- o Only **school access** remains active until progression is regained."}
{"path": ["**Academic Life & Pedagogy**", "**9. Freezes**"], "content": "### **(Temporary Pauses)**\n\nA freeze is a temporary pause in your academic progress. It exists to support students who need to step back from their studies for an **exceptional valid personal, health, or family reasons**, not to postpone work or extend benefits unnecessarily.\n\n### **Rules:**\n\n- All freeze requests must be submitted in advance to the BOCAL.\n- Freezes for personal, health, or family reasons require validation from **both the BOCAL** and **the 1337 Doctor (Dr. Hanane RASFI)**.\n- Exceptionally, students may request a freeze during holidays; limited to one (1) week during Eids and two (2) weeks during summer but with prior approval from the BOCAL.\n- Unplanned absences or inactive periods without approval will not be considered as freezes.\n- Extended or repeated freezes may affect your benefits and overall academic timeline, including housing and Restaurant eligibility.\n\nFreezes are here to help, not to reset or delay your learning. Use them only when necessary and always communicate with the BOCAL."}
{"path": ["**Academic Life & Pedagogy**", "**10. Internship Policy**"], "content": "Internships are an essential part of your journey at 1337. They allow you to apply what you've learned in real-world environments, gain hands-on experience, and connect with professionals in the tech and innovation ecosystem. Each one must align with your academic goals and the values of 1337.\n\n### **a. Internship Rules (Internship 1 & 2)**\n\nTo ensure your internship supports your learning path and professional growth:\n\n- Your internship subject must be **validated by the BOCAL before it begins**.\n- The topic must be **technical** and directly related to software development or coding.\n- Every internship must have a **technical supervisor.**\n- The **internship contract** must be uploaded before the start date.\n- Internships last **between 4 and 6 months.**\n- A **peer video correction** must be completed within **one month** after the internship end date.\n- If not completed within this time, access and benefits are suspended until the correction is done.\n- Students have **one month to secure an internship**  after becoming eligible. During this month, all social benefits remain active.\n- After this period, if no internship is confirmed, **all benefits are suspended**, though access to the school remains.\n- During the internship period, students cannot push new projects, except for the Technical Piscine only the period before the internship, and only with prior notification and approval from the BOCAL.\n\n### **b. Changing an Internship**\n\nChanging an internship is **exceptional and requires staff evaluation.** If the internship project does not match its original description or is canceled by the company:\n\n- The student must **report it immediately** to the BOCAL.\n- An a**mendment must be uploaded** in the contract section on Intra.\n- If canceled by the Company, **we need feedback from the company supervisor** (via Intra if midevaluation, or by email if before).\n\n### **c. 2nd Internship**\n\nThe second internship prepares you for your professional transition and autonomy.\n\n- Students at **Level 14 or more** can begin their 2nd internship.\n- Students can push projects during this internship.\n- **No scholarship** is provided during this period.\n- A peer video correction must be completed within one month after the internship ends.\n  - After correction, **alumnization happens automatically**.\n### **d. Startup Internships**\n\nInternships as startups are encouraged when they align with your learning objectives. They are accepted under the following conditions:\n\n- The startup's **technical (the priority)and business goals** must align with 1337's educational principles.\n- The student must find a **technical mentor** from the 1337 staff.\n- Students working on their own entrepreneurial projects can receive **guidance and support from the school's** entrepreneurship initiatives.\n\n### **e. External or Non-Technical Internships**\n\nIn some cases, internships that are not purely technical can be accepted if they bring strong educational value.\n\n- They must be **discussed & approved** by the BOCAL.\n- They may be accepted if they take place within the **OCP/UM6P ecosystem** or in **exceptional** external companies that meet 1337's learning standards.\n\nThe goal is not to restrict opportunities but to ensure every internship contributes to your personal and technical growth."}
{"path": ["**Academic Life & Pedagogy**", "**11. LOGTIME**"], "content": "Your access to benefits like housing, restaurant, scholarships, depends on your LOGTIME. These systems are tracked internally to ensure fairness and engagement.\n\n### **LOGTIME targets:**\n\n- **Restaurant access:** 30h/week.\n- **Housing:** 120h/month.\n- Blackhole and Freeze rules apply as defined in school policy.\n\n### **Sanctions for LOGTIME Cheating:**\n\n- **First offense:** Loss of benefits for **3 months**.\n- **Second offense:** Permanent **loss of benefits**.\n\n**LOGTIME** is not about control, it's about commitment. Presence is how we build community, collaboration, and progress."}
{"path": ["**Academic Life & Pedagogy**", "**12. Scholarship**"], "content": "Scholarships are offered to support active students who meet LOGTIME requirements and do not benefit from accommodation.\n\n### **Conditions:**\n\n- **Must not be benefiting from school accommodation**. students who live outside campus and meet all activity requirements receive **a monthly scholarship of 1000 MAD** to help cover personal living expenses such as rent.\n- Must meet LOGTIME requirements.\n- Amounts during the first internship:\n- o 2000 MAD no housing or Restaurant.\n- o 1000 MAD with either housing or Restaurant.\n- o 0 MAD with both housing and Restaurant.\n- If UM6P provides a benefit, 1337 will not duplicate it.\n- Scholarships may be suspended for disciplinary reasons (e.g., behavior or misconduct…)."}
{"path": ["**Academic Life & Pedagogy**", "**13. Transportation**"], "content": "Transportation is one of the social benefits provided by 1337 to make student life easier. Depending on your campus, transportation may include day and/ or night shuttles organized to help you travel safely between the school and designated areas.\n\nEach campus has its own transportation schedule, routes, and rules, these are communicated locally by the BOCAL.\n\n### **Usage Rules**\n\n- Transportation is a benefit, not a right, it is reserved for active students only.\n- Students under the following statuses cannot use the transportation service: Blackhole, Suspension, or Alumni (except with specific prior approval)\n\n- Students must respect the schedules, drivers, and other passengers.\n- Any misuse, damage, or inappropriate behavior during transportation may **lead to disciplinary action or loss of access to the service**.\n\nTransportation is provided to help you focus on your studies and stay engaged with campus life, use it responsibly and respectfully."}
{"path": ["**Academic Life & Pedagogy**", "**14. Insurance Coverage**"], "content": "Every 1337 student is automatically covered by the school's insurance from the first day of integration. This coverage is here to keep you safe and supported while you learn.\n\n### **a. Types of Coverage**\n\n- **1. Civil Liability (RC):** Protects you if you unintentionally cause harm or damage to another person or their property. It's a guarantee that ensures you are protected in case of an unintentional incident involving a third party.\n- **2. Assistance:** a 24/7 on-campus assistance (services, not direct cash reimbursement) in case of an emergency or unexpected situation due to accident or illness within the campus.\n- **3. Health & Life (Illness / Accident ....):** Covers illness or accident, including medical care, hospitalization, and related expenses… according to the insurer's terms.\n\nIn severe cases, it provides benefits as defined in the policy. (**Coverage limits, eligible expenses, and procedures are to check with the Health Center.**)\n\n### **b. Duration of Coverage**\n\n- **All three contracts** (RC, Assistance, Health/Life) are active from your **first day at 1337**.\n- **Health & Life** remains valid for a maximum of two years after the Common Core (18 months + internship, managed by the Heart System), then it is automatically terminated, it's **managed via Supervisor**.\n- RC and Assistance remain active as long as you are officially enrolled (full-time or part-time, regardless of Supervisor).\n\n### **c. Important Notes**\n\n- If you already have another personal or institutional insurance (other than the school one), **you must inform the BOCAL** on your first day at 1337 or on the day you declare your external insurance.\n- **For any incident**, follow the reporting steps and timelines provided by the BOCAL/insurer to ensure coverage applies."}
{"path": ["**Academic Life & Pedagogy**", "**15. Attendo System**"], "content": "Attendo is the system that links your presence on campus with your restaurant access. It's a fairness system designed to make sure the restaurant benefits only students who are actively studying and contributing to campus life.\n\n### **How It Works**\n\n- Every time you eat at the restaurant, that day is added to your personal **Attendo chain**.\n- Once you've eaten on 7 different days, that forms one **Attendo week**.\n- Attendo checks your total **logtime** for those 7 days.\n\n### **To stay eligible for the restaurant:**\n\n- You must log **at least 30 hours** of presence during those 7 restaurant days.\n- If you meet this goal, your restaurant **badge stays active**.\n- If you fall below 30 hours, **your access freezes automatically** until you catch up.\n- Once you recover your missing hours, your access reactivates automatically, no staff intervention needed.\n\n### **Key Rules**\n\n- **Attendo is individual,** never share your badge or let someone else use it.\n- Your **Attendo week** is based only on real restaurant days, not calendar weeks.\n- **Inactive days or official freeze periods** do not count toward your 7 days.\n- You can check your live status anytime on Attendo:\n- **o Green =** active access\n- **o Red =** frozen access\n\n### **Why It Exists**\n\nAttendo keeps the system fair by ensuring that:\n\n- Restaurant access equals real school activity.\n- Students who are consistently engaged are the ones benefiting.\n- Badge sharing or unfair use of benefits is prevented.\n\nAttendo is here to promote fairness, responsibility, and community trust — so that every student who truly contributes gets the support they deserve."}
{"path": ["**Academic Life & Pedagogy**", "**16. Summary: The 1337 Academic Mindset**"], "content": "Your success at 1337 depends on three things:\n\n- **Consistency** progress a little every day.\n- **Integrity** do your work honestly.\n- **Engagement**  show up, contribute, and help others.\n\nAt 1337, progress is personal, but growth is collective. This is not just a school — it's a training ground for the future.\n\nOwn it, live it, and make it count.\n\n*\"1337 gives you the tools, the space, and the trust*"}
